# Rebar Bend Data Crank Length 1 Property

Source: https://www.revitapidocs.com/2026/86099881-601e-6412-7bcd-727023dab8c5.htm

---

| Rebar Bend Data Crank Length 1 Property |
| --- |

Identifies the crank length at the end.

The default value is 0\. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values.

**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double CrankLength1 { get; }
```

```
Public ReadOnly Property CrankLength1 As Double
	Get
```

```
public:
property double CrankLength1 {
	double get ();
}
```

```
member CrankLength1 : float with get
```

#### Property Value

Double See Also

#### Reference

RebarBendData Class Autodesk.Revit.DB.Structure Namespace